## Pandas

### Pandas - Series

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [9]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b':20, 'c':30}

In [10]:
pd.Series(my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series([2,3,4,5])

0    2
1    3
2    4
3    5
dtype: int64

In [18]:
ser1 = pd.Series([1,2,3,4], ['Portugal', 'USA', 'Germany', 'UK'])

In [19]:
ser1

Portugal    1
USA         2
Germany     3
UK          4
dtype: int64

In [25]:
ser2 = pd.Series([1,2,4,5], ['China', 'Italy', 'Brazil', 'Portugal'])

In [26]:
ser2

China       1
Italy       2
Brazil      4
Portugal    5
dtype: int64

In [27]:
ser1['Portugal']

1

In [28]:
ser1 + ser2

Brazil      NaN
China       NaN
Germany     NaN
Italy       NaN
Portugal    6.0
UK          NaN
USA         NaN
dtype: float64

### Pandas - Data Frames 1

In [29]:
from numpy.random import randn

In [30]:
np.random.seed(101) # make sure we get the same random numbers

In [33]:
df = pd.DataFrame(randn(5,4), ['a', 'b', 'c', 'd', 'e'], ['w','x', 'y', 'z'])

In [34]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [40]:
df['w']

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
e   -0.116773
Name: w, dtype: float64

In [44]:
df.w

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
e   -0.116773
Name: w, dtype: float64

In [46]:
df[['w', 'z']]

          w         z
a  0.302665 -1.159119
b -0.134841  0.184502
c  0.807706  0.329646
d -0.497104  0.484752
e -0.116773  1.996652

In [48]:
df['new'] = df['w'] + df['y']

In [49]:
df

          w         x         y         z       new
a  0.302665  1.693723 -1.706086 -1.159119 -1.403420
b -0.134841  0.390528  0.166905  0.184502  0.032064
c  0.807706  0.072960  0.638787  0.329646  1.446493
d -0.497104 -0.754070 -0.943406  0.484752 -1.440510
e -0.116773  1.901755  0.238127  1.996652  0.121354

In [51]:
df.drop('new', axis = 1)

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [53]:
df = df.drop('new', axis=1)

In [54]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [56]:
df.drop('w', axis=1, inplace=True)

In [58]:
df.drop('e')

          x         y         z
a  1.693723 -1.706086 -1.159119
b  0.390528  0.166905  0.184502
c  0.072960  0.638787  0.329646
d -0.754070 -0.943406  0.484752

In [59]:
df.shape

(5, 3)

In [60]:
df

          x         y         z
a  1.693723 -1.706086 -1.159119
b  0.390528  0.166905  0.184502
c  0.072960  0.638787  0.329646
d -0.754070 -0.943406  0.484752
e  1.901755  0.238127  1.996652

In [62]:
df.loc['a']

x    1.693723
y   -1.706086
z   -1.159119
Name: a, dtype: float64

df.iloc[1]

In [67]:
df.loc['a', 'z']

-1.1591194155484297

In [74]:
df.loc[['a', 'b'], ['y','z']]

          y         z
a -1.706086 -1.159119
b  0.166905  0.184502

In [75]:
df['test'] = df['y'] * df['z']

In [76]:
df['test']

a    1.977557
b    0.030794
c    0.210574
d   -0.457318
e    0.475457
Name: test, dtype: float64

In [77]:
df

          x         y         z      test
a  1.693723 -1.706086 -1.159119  1.977557
b  0.390528  0.166905  0.184502  0.030794
c  0.072960  0.638787  0.329646  0.210574
d -0.754070 -0.943406  0.484752 -0.457318
e  1.901755  0.238127  1.996652  0.475457

In [80]:
df[:2]

          x         y         z      test
a  1.693723 -1.706086 -1.159119  1.977557
b  0.390528  0.166905  0.184502  0.030794

### Pandas - Data Frames 2

In [81]:
new_df = pd.DataFrame(randn(5, 4), ['Manso', 'Afonso', 'António', 'Kiko', 'Aguiar'], ['A', 'B', 'C', 'D'])

In [82]:
new_df

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [83]:
new_df > 0

             A      B      C      D
Manso    False   True  False   True
Afonso    True  False  False   True
António   True  False  False  False
Kiko      True  False   True   True
Aguiar   False   True  False   True

In [84]:
new_df[new_df > 0]

                A         B         C         D
Manso         NaN  0.196800       NaN  0.000366
Afonso   1.025984       NaN       NaN  0.649826
António  2.154846       NaN       NaN       NaN
Kiko     0.147027       NaN  0.558769  1.024810
Aguiar        NaN  1.862864       NaN  0.610478

In [90]:
new_df[new_df['A']>0]

                A         B         C         D
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810

In [93]:
new_df[new_df['D']<0]

                A         B         C         D
António  2.154846 -0.610259 -0.755325 -0.346419

In [96]:
new_df[new_df['B'] > 0][['A', 'B']]

               A         B
Manso  -0.993263  0.196800
Aguiar -0.925874  1.862864

In [101]:
boolseries = new_df['A'] > 0

In [102]:
boolseries

Manso      False
Afonso      True
António     True
Kiko        True
Aguiar     False
Name: A, dtype: bool

In [107]:
result = new_df[boolseries][['A', 'B']]

In [108]:
result

                A         B
Afonso   1.025984 -0.156598
António  2.154846 -0.610259
Kiko     0.147027 -0.479448

In [109]:
new_df

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [122]:
new_df[(new_df['B']> 0) & (new_df['A'] > 0)]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [123]:
new_df[(new_df['B']> 0) | (new_df['A'] > 0)]

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [124]:
new_df.reset_index()

     index         A         B         C         D
0    Manso -0.993263  0.196800 -1.136645  0.000366
1   Afonso  1.025984 -0.156598 -0.031579  0.649826
2  António  2.154846 -0.610259 -0.755325 -0.346419
3     Kiko  0.147027 -0.479448  0.558769  1.024810
4   Aguiar -0.925874  1.862864 -1.133817  0.610478

In [125]:
new_df

                A         B         C         D
Manso   -0.993263  0.196800 -1.136645  0.000366
Afonso   1.025984 -0.156598 -0.031579  0.649826
António  2.154846 -0.610259 -0.755325 -0.346419
Kiko     0.147027 -0.479448  0.558769  1.024810
Aguiar  -0.925874  1.862864 -1.133817  0.610478

In [133]:
new_index = 'PT DE UK USA DEN'.split()

In [134]:
new_index

['PT', 'DE', 'UK', 'USA', 'DEN']

In [135]:
new_df['States'] = new_index

In [136]:
new_df

                A         B         C         D States
Manso   -0.993263  0.196800 -1.136645  0.000366     PT
Afonso   1.025984 -0.156598 -0.031579  0.649826     DE
António  2.154846 -0.610259 -0.755325 -0.346419     UK
Kiko     0.147027 -0.479448  0.558769  1.024810    USA
Aguiar  -0.925874  1.862864 -1.133817  0.610478    DEN

In [138]:
new_df.set_index('States')

               A         B         C         D
States
PT     -0.993263  0.196800 -1.136645  0.000366
DE      1.025984 -0.156598 -0.031579  0.649826
UK      2.154846 -0.610259 -0.755325 -0.346419
USA     0.147027 -0.479448  0.558769  1.024810
DEN    -0.925874  1.862864 -1.133817  0.610478

### Pandas - Data Frames 3

In [140]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [141]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [142]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [145]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [147]:
df.index.names = ['Groups', 'Num']

In [149]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [153]:
df.loc['G2'].loc[2]['B']

-0.7417897046689249

In [19]:
df.xs(1, level='Num')

AttributeError: 'RangeIndex' object has no attribute 'get_loc_level'

### Pandas - Dealing with missing data

In [7]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]}

In [8]:
df = pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
# drops any record with null values (default)
df.dropna()

     A    B  C
0  1.0  5.0  1

In [14]:
# drops any columns that has a null value
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [15]:
# threshold drops records/columns with more that x NULL values
df.dropna(axis=0, thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [16]:
# replace the missing values with methods
df.fillna(value='Fill value')

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [18]:
#replace the missing value by the mean of that variable
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Pandas - Group by Functions

In [20]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [33]:
# call the group by method 
byCompany = df.groupby('Company')

In [34]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [36]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [38]:
df.groupby('Person').mean().loc['Amy']

Sales    340
Name: Amy, dtype: int64

In [39]:
df.groupby('Person').count()

         Company  Sales
Person
Amy            1      1
Carl           1      1
Charlie        1      1
Sam            1      1
Sarah          1      1
Vanessa        1      1

In [44]:
df.groupby('Company').describe().transpose().iloc[1]

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: (Sales, mean), dtype: float64

### Merging, Joining & Concatenating Data

In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [4]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [5]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [11]:
# concat concatenates the 3 data frames into 1
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [12]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [17]:
# merge the two dataframes on the key column PK
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [18]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

### Pandas Operations

In [19]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [20]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [22]:
df['col2'].nunique()

3

In [3]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [4]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [7]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input & Data Output

In [8]:
import pandas as pd

In [11]:
# read data from a csv file as a data frame
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
df = pd.read_csv('example')

In [15]:
# write a data frame into a file
df.to_csv('my_output', index=False) # avoid having the index on the file

In [21]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [23]:
# read data from HTML format
df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [25]:
type(df)

list

In [29]:
df = df[0]

In [30]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"

In [31]:
# read data from sql
from sqlalchemy import create_engine

In [33]:
engine = create_engine('sqlite:///:memory:')

In [34]:
df.to_sql('my_table', engine)

In [36]:
sqldf = pd.read_sql('my_table', con=engine)

In [38]:
sqldf

,index,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
...,...,...,...,...,...,...,...
555,555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [ ]:
df.sort_values()